<?PHP
function zmeika($строка = 'пример', $длина)
{
  $z=array();
  $длинна_строки = strlen($строка);
  $k = 0;
  $размер_массива = $длина* $длина - 1;
  for ($i=0; $i<$длина; $i++)
  {
    for ($j=0; $j<$длина; $j++)
    {
        $z[$i][$j]= ' ';
    }
  }
  $j = 0;
  $k = 0;
  $куда_идем = 'вправо';
  $меняем_направление = false;
  for($i = 0; $i < $длинна_строки;$i++)
  {
    $буква = $строка[$i];
        if ($i > $размер_массива){
        break;
    }
    
    if ($k == $длина){
        $меняем_направление = true;
    }
    if($j == $длина){
        $меняем_направление = true;
    }
    if (($k < 0) || ($j < 0)){
     $меняем_направление = true;
    }
    
    if($меняем_направление){
        switch ($куда_идем){
            case 'верх':
                $куда_идем = 'вправо';
                $k++;
                $j--;
                break;
            case 'вправо':
                $куда_идем = 'вниз';
                $k--;
                $j++;
                break;
            case 'вниз':
                $куда_идем = 'влево';
                $k--;
                $j--;
                break;
            case 'влево':
                $куда_идем = 'верх';
                $k++;
                $j--;
                break;
            default:
                break;
        }
        $меняем_направление = false;
    }else {
         if ($z[$j][$k] != ' '){
                 switch ($куда_идем){
            case 'верх':
                $куда_идем = 'вправо';
                $k++;
                $j++;
                break;
            case 'вправо':
                $куда_идем = 'вниз';
                $k--;
                $j++;
                break;
            case 'вниз':
                $куда_идем = 'влево';
                $k--;
                $j--;
                break;
            case 'влево':
                $куда_идем = 'верх';
                $k++;
                $j--;
                break;
            default:
                break;
        }
         }
    }
   $z[$j][$k] = $буква;
    
    switch ($куда_идем){
        case 'вправо':
            $k++;
            break;
        case 'вниз':
            $j++;
            break;
        case 'влево':
            $k--;
            break;
        case 'верх':
            $j--;
            break;
        default:
            break;
    }
     

  }
  
  return $z;
}

$положительное_число = 4;
$a=zmeika('123456789-1234567', $положительное_число);


echo '<table>';
for ($tr= 0; $tr < $положительное_число; $tr++)
{
    echo '<tr>';
    for ($td = 0; $td < $положительное_число; $td++) 
    {
        echo '<td>';
        echo $a[$tr][$td];
        echo '<td>';
    }
    echo '</tr>';
}
echo '</table>';
?>